controllers/SiteController.php

    public function actionIndex()
    {

        $masyarakat = Masyarakat::find()->count();
        $teknisi = Teknisi::find()->where(['status_akun' => "Aktif"])->count();
        $topup = Topup::find()->where(['proses' => "Diproses"])->count();
---
SELECT COUNT(*) FROM `tb_masyarakat`
SELECT COUNT(*) FROM `tb_teknisi` WHERE `status_akun`='Aktif'
SELECT COUNT(*) FROM `tb_topup` WHERE `proses`='Diproses'