controllers/TopupController.php

SELECT * FROM `tb_topup` WHERE `id_topup`='4'
SELECT EXISTS(SELECT * FROM `tb_masyarakat` WHERE `tb_masyarakat`.`nik`='1402012911960001')
SELECT * FROM `tb_masyarakat` WHERE `nik`='1402012911960001'
UPDATE `tb_topup` SET `proses`='Diterima' WHERE `id_topup`=4
---
    public function actionTerima($id){


        $model = Topup::find()->where(['id_topup' => $id])->one();
        $model->proses = "Diterima";

        // tambah nilai saldo
        $masyarakat = Masyarakat::find()->where(['nik' => $model->nik])->one();
        $masyarakat->saldo += $model->nominal;
        // echo "<pre>";
        // var_dump($masyarakat);
        // exit();


        if ($model->save() && $masyarakat->update()) {

SELECT * FROM `tb_topup` WHERE `id_topup`='2'
---
    public function actionTolak($id){


        $model = Topup::find()->where(['id_topup' => $id])->one();